# SystemType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..SystemType Property
ElectricalSystem Class See Also
---
The Electrical System Type of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElectricalSystemType SystemType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SystemType As ElectricalSystemType
	Get
```

Visual C++
---
```text
public:
property ElectricalSystemType SystemType {
	ElectricalSystemType get ();
}
```

# Remarks
This property is used to retrieve the Electrical System Type of the Electrical System.
# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace